# Assignment 8: M5 Competition Demand Forecasting with DeepAR-Nicholas Petr

## Import required packages and load datasets

In [1]:
import os
import numpy as np
import pandas as pd
#import mxnet
import re
from datetime import datetime
from pandas.tseries.holiday import USFederalHolidayCalendar as Calendar

In [2]:
calendar = pd.read_csv("calendar.csv")
print("calendar Shape:", calendar.shape)

sales_train = pd.read_csv("sales_train_validation.csv")
print("sales_train Shape:", sales_train.shape)

sell_prices = pd.read_csv("sell_prices.csv")
print("sell_prices Shape:", sell_prices.shape)

calendar Shape: (1969, 13)
sales_train Shape: (30490, 1918)
sell_prices Shape: (6841121, 4)

## 1. Which state has the highest sales?

In [3]:
sales_train.head()

,item_id,dept_id,cat_id,store_id,state_id,d_1,d_2,d_3,d_4,d_5,...,d_1904,d_1905,d_1906,d_1907,d_1908,d_1909,d_1910,d_1911,d_1912,d_1913
0,HOBBIES_1_001,HOBBIES_1,HOBBIES,CA_1,CA,0,0,0,0,0,...,1,3,0,1,1,1,3,0,1,1
1,HOBBIES_1_002,HOBBIES_1,HOBBIES,CA_1,CA,0,0,0,0,0,...,0,0,0,0,0,1,0,0,0,0
2,HOBBIES_1_003,HOBBIES_1,HOBBIES,CA_1,CA,0,0,0,0,0,...,2,1,2,1,1,1,0,1,1,1
3,HOBBIES_1_004,HOBBIES_1,HOBBIES,CA_1,CA,0,0,0,0,0,...,1,0,5,4,1,0,1,3,7,2
4,HOBBIES_1_005,HOBBIES_1,HOBBIES,CA_1,CA,0,0,0,0,0,...,2,1,1,0,1,1,2,2,2,4

In [4]:
sales_train['total'] = sales_train.loc[:, 'd_1':'d_1913'].sum(axis=1)
sales_train['total']

0         600
1         493
2         288
3        3288
4        1849
         ...
30485    1022
30486     720
30487    1712
30488     702
30489    1329
Name: total, Length: 30490, dtype: int64

### California has the highest sales

In [5]:
sales_train.groupby('state_id')['total'].sum().sort_values(ascending=False)

state_id
CA    28675547
TX    18899006
WI    18120856
Name: total, dtype: int64

## 2. Which department has the highest sales?

### FOODS_3 has the highest sales

In [6]:
sales_train.groupby('dept_id')['total'].sum().sort_values(ascending=False)

dept_id
FOODS_3        32372076
HOUSEHOLD_1    11500526
FOODS_2         7629822
HOBBIES_1       5596460
FOODS_1         5088041
HOUSEHOLD_2     2980144
HOBBIES_2        528340
Name: total, dtype: int64

## 3. Which department has the highest number of products?

### FOODS_3 has the highest number of products

In [7]:
sales_train.groupby('dept_id')['item_id'].nunique().sort_values(ascending=False)

dept_id
FOODS_3        823
HOUSEHOLD_1    532
HOUSEHOLD_2    515
HOBBIES_1      416
FOODS_2        398
FOODS_1        216
HOBBIES_2      149
Name: item_id, dtype: int64

## 4. Which department has the highest mean price?

In [8]:
sell_prices.head()

  store_id        item_id  wm_yr_wk  sell_price
0     CA_1  HOBBIES_1_001     11325        9.58
1     CA_1  HOBBIES_1_001     11326        9.58
2     CA_1  HOBBIES_1_001     11327        8.26
3     CA_1  HOBBIES_1_001     11328        8.26
4     CA_1  HOBBIES_1_001     11329        8.26

In [9]:
sell_prices['dept_id'] = sell_prices['item_id'].str[:-4]

### HOBBIES_1 has the highest mean price

In [10]:
sell_prices.groupby("dept_id")['sell_price'].mean().sort_values(ascending=False)

dept_id
HOBBIES_1      6.225784
HOUSEHOLD_2    5.855558
HOUSEHOLD_1    5.057583
FOODS_2        4.084008
FOODS_1        3.374649
FOODS_3        2.842107
HOBBIES_2      2.686807
Name: sell_price, dtype: float64

## 5. Which is the best performing store?

### CA_3 is the best performing store

In [11]:
sales_train.groupby("store_id")["total"].sum().sort_values(ascending=False)

store_id
CA_3    11188180
CA_1     7698216
TX_2     7214384
WI_2     6544012
WI_3     6427782
TX_3     6089330
CA_2     5685475
TX_1     5595292
WI_1     5149062
CA_4     4103676
Name: total, dtype: int64

## 6. Which month had the highest sales?

In [12]:
date_list = pd.date_range(start="2011-01-29",end="2016-04-24")
len(date_list)

1913

In [13]:
daily_sales_list = list(sales_train.loc[:, 'd_1':'d_1913'].sum(axis=0))
len(daily_sales_list)

1913

In [14]:
daily_sales = pd.DataFrame({"date": date_list, 
                               "daily_sales": daily_sales_list})
daily_sales.head()

        date  daily_sales
0 2011-01-29        32631
1 2011-01-30        31749
2 2011-01-31        23783
3 2011-02-01        25412
4 2011-02-02        19146

In [15]:
daily_sales["year"] = daily_sales["date"].dt.year
daily_sales["month"] = daily_sales["date"].dt.month
daily_sales["day"] = daily_sales["date"].dt.day

daily_sales.head()

        date  daily_sales  year  month  day
0 2011-01-29        32631  2011      1   29
1 2011-01-30        31749  2011      1   30
2 2011-01-31        23783  2011      1   31
3 2011-02-01        25412  2011      2    1
4 2011-02-02        19146  2011      2    2

### The month of March 2016 had the highest sales

In [16]:
daily_sales.groupby(["year", "month"])["daily_sales"].sum().sort_values(ascending=False)

year  month
2016  3        1275746
2015  8        1254341
      10       1248437
      7        1232147
2016  1        1215286
                ...
2011  6         753380
      4         737713
      2         726375
      5         719562
      1          88163
Name: daily_sales, Length: 64, dtype: int64

## 7. Which weekday do people prefer to grocery shopping in different states?

## NOTE: I am making the assumption that "Weekday" means day of the *work* week, and therefore I am removing Saturday and Sunday from contention

In [17]:
daily_sales['day_of_week'] = daily_sales['date'].dt.dayofweek
daily_sales['day_of_week_text'] = daily_sales['date'].dt.day_name()

daily_sales.head()

        date  daily_sales  year  month  day  day_of_week day_of_week_text
0 2011-01-29        32631  2011      1   29            5         Saturday
1 2011-01-30        31749  2011      1   30            6           Sunday
2 2011-01-31        23783  2011      1   31            0           Monday
3 2011-02-01        25412  2011      2    1            1          Tuesday
4 2011-02-02        19146  2011      2    2            2        Wednesday

In [18]:
state_sales = sales_train.groupby('state_id').sum().loc[:, 'd_1':'d_1913'].T

state_sales

state_id     CA     TX     WI
d_1       14195   9438   8998
d_2       13805   9630   8314
d_3       10108   6778   6897
d_4       11047   7381   6984
d_5        9925   5912   3309
...         ...    ...    ...
d_1909    15148   9600  10595
d_1910    14488   9602  10943
d_1911    17095  10615  12807
d_1912    21834  12266  14862
d_1913    23187  12282  14326

[1913 rows x 3 columns]

In [19]:
daily_sales['CA'] = state_sales["CA"].values
daily_sales['TX'] = state_sales["TX"].values
daily_sales['WI'] = state_sales["WI"].values

daily_sales.head()

,date,daily_sales,year,month,day,day_of_week,day_of_week_text,CA,TX,WI
0,2011-01-29,32631,2011,1,29,5,Saturday,14195,9438,8998
1,2011-01-30,31749,2011,1,30,6,Sunday,13805,9630,8314
2,2011-01-31,23783,2011,1,31,0,Monday,10108,6778,6897
3,2011-02-01,25412,2011,2,1,1,Tuesday,11047,7381,6984
4,2011-02-02,19146,2011,2,2,2,Wednesday,9925,5912,3309

In [20]:
daily_sales_weekday = daily_sales[(daily_sales.day_of_week != 5) & (daily_sales.day_of_week != 6)]
daily_sales_weekday

,date,daily_sales,year,month,day,day_of_week,day_of_week_text,CA,TX,WI
2,2011-01-31,23783,2011,1,31,0,Monday,10108,6778,6897
3,2011-02-01,25412,2011,2,1,1,Tuesday,11047,7381,6984
4,2011-02-02,19146,2011,2,2,2,Wednesday,9925,5912,3309
5,2011-02-03,29211,2011,2,3,3,Thursday,11322,9006,8883
6,2011-02-04,28010,2011,2,4,4,Friday,12251,6226,9533
...,...,...,...,...,...,...,...,...,...,...
1906,2016-04-18,38059,2016,4,18,0,Monday,17052,9868,11139
1907,2016-04-19,37570,2016,4,19,1,Tuesday,15784,10922,10864
1908,2016-04-20,35343,2016,4,20,2,Wednesday,15148,9600,10595
1909,2016-04-21,35033,2016,4,21,3,Thursday,14488,9602,10943
1910,2016-04-22,40517,2016,4,22,4,Friday,17095,10615,12807

### People prefer to grocery shop on Friday in California 

### People prefer to grocery shop on Monday in Texas 

### People prefer to grocery shop on Friday in Wisconsin

In [21]:
daily_sales_weekday.groupby("day_of_week_text").sum()

,daily_sales,year,month,day,day_of_week,CA,TX,WI
day_of_week_text,,,,,,,,
Friday,9343694,549608,1731,4273,1092,4006162,2627034,2710498
Monday,8968860,549604,1742,4306,0,3967465,2634239,2367156
Thursday,8245967,549607,1733,4305,819,3536236,2388387,2321344
Tuesday,8290677,549605,1741,4247,273,3614175,2385601,2290901
Wednesday,8192736,549606,1737,4275,546,3522441,2369281,2301014

## 8. Which holiday or event recorded the highest sales?

In [22]:
cal = Calendar()
holidays = cal.holidays(start=date_list.min(), end=date_list.max())

daily_sales['holiday'] = daily_sales['date'].isin(holidays)

In [23]:
daily_sales

,date,daily_sales,year,month,day,day_of_week,day_of_week_text,CA,TX,WI,holiday
0,2011-01-29,32631,2011,1,29,5,Saturday,14195,9438,8998,False
1,2011-01-30,31749,2011,1,30,6,Sunday,13805,9630,8314,False
2,2011-01-31,23783,2011,1,31,0,Monday,10108,6778,6897,False
3,2011-02-01,25412,2011,2,1,1,Tuesday,11047,7381,6984,False
4,2011-02-02,19146,2011,2,2,2,Wednesday,9925,5912,3309,False
...,...,...,...,...,...,...,...,...,...,...,...
1908,2016-04-20,35343,2016,4,20,2,Wednesday,15148,9600,10595,False
1909,2016-04-21,35033,2016,4,21,3,Thursday,14488,9602,10943,False
1910,2016-04-22,40517,2016,4,22,4,Friday,17095,10615,12807,False
1911,2016-04-23,48962,2016,4,23,5,Saturday,21834,12266,14862,False
1912,2016-04-24,49795,2016,4,24,6,Sunday,23187,12282,14326,False

### 2015-07-03, which would have been the Federal Holiday associated with the 4th of July in 2015, recorded the highest sales for any individual event

In [24]:
holiday_sales = daily_sales[daily_sales["holiday"]].reset_index(drop=True)
holiday_sales.sort_values(by="daily_sales", ascending=False)

,date,daily_sales,year,month,day,day_of_week,day_of_week_text,CA,TX,WI,holiday
42,2015-07-03,54154,2015,7,3,4,Friday,23408,14085,16661,True
23,2013-09-02,47072,2013,9,2,0,Monday,21384,13152,12536,True
50,2016-02-15,46152,2016,2,15,0,Monday,19231,12115,14806,True
43,2015-09-07,45762,2015,9,7,0,Monday,21191,12774,11797,True
13,2012-09-03,44525,2012,9,3,0,Monday,19074,13484,11967,True
33,2014-09-01,43256,2014,9,1,0,Monday,19179,12686,11391,True
44,2015-10-12,42240,2015,10,12,0,Monday,18473,11422,12345,True
32,2014-07-04,38593,2014,7,4,4,Friday,16997,11912,9684,True
49,2016-01-18,38340,2016,1,18,0,Monday,18004,10685,9651,True
41,2015-05-25,37817,2015,5,25,0,Monday,17642,10552,9623,True
40,2015-02-16,37147,2015,2,16,0,Monday,16235,10259,10653,True
24,2013-10-14,36836,2013,10,14,0,Monday,15592,10831,10413,True
22,2013-07-04,36783,2013,7,4,3,Thursday,17287,11248,8248,True
25,2013-11-11,36396,2013,11,11,0,Monday,16490,10360,9546,True
21,2013-05-27,36277,2013,5,27,0,Monday,17033,11139,8105,True
20,2013-02-18,34638,2013,2,18,0,Monday,15076,10486,9076,True
30,2014-02-17,34557,2014,2,17,0,Monday,15790,11467,7300,True
39,2015-01-19,34412,2015,1,19,0,Monday,15535,10114,8763,True
14,2012-10-08,33790,2012,10,8,0,Monday,15393,9386,9011,True
34,2014-10-13,33557,2014,10,13,0,Monday,15008,10122,8427,True
31,2014-05-26,33459,2014,5,26,0,Monday,16291,9167,8001,True
11,2012-05-28,33407,2012,5,28,0,Monday,14997,11254,7156,True
45,2015-11-11,33338,2015,11,11,2,Wednesday,14410,8878,10050,True
15,2012-11-12,33213,2012,11,12,0,Monday,13310,9435,10468,True
8,2012-01-02,33053,2012,1,2,0,Monday,15152,9307,8594,True
29,2014-01-20,32706,2014,1,20,0,Monday,15452,9189,8065,True
12,2012-07-04,32656,2012,7,4,2,Wednesday,13944,9860,8852,True
48,2016-01-01,32651,2016,1,1,4,Friday,13364,8845,10442,True
35,2014-11-11,32588,2014,11,11,1,Tuesday,14501,8797,9290,True
19,2013-01-21,30887,2013,1,21,0,Monday,13849,9222,7816,True
9,2012-01-16,30548,2012,1,16,0,Monday,14013,9018,7517,True
10,2012-02-20,30218,2012,2,20,0,Monday,15012,8907,6299,True
3,2011-09-05,30158,2011,9,5,0,Monday,13807,9371,6980,True
5,2011-11-11,29755,2011,11,11,4,Friday,13522,8425,7808,True
4,2011-10-10,29401,2011,10,10,0,Monday,13561,9623,6217,True
7,2011-12-26,28032,2011,12,26,0,Monday,12390,9044,6598,True
38,2015-01-01,26452,2015,1,1,3,Thursday,11169,7693,7590,True
18,2013-01-01,24087,2013,1,1,1,Tuesday,9640,8334,6113,True
0,2011-02-21,23966,2011,2,21,0,Monday,11997,7297,4672,True
28,2014-01-01,23845,2014,1,1,2,Wednesday,10884,7837,5124,True
46,2015-11-26,23631,2015,11,26,3,Thursday,9570,7855,6206,True
2,2011-07-04,23033,2011,7,4,0,Monday,10583,7983,4467,True
1,2011-05-30,22538,2011,5,30,0,Monday,10768,7152,4618,True
16,2012-11-22,21909,2012,11,22,3,Thursday,8002,8259,5648,True
36,2014-11-27,21844,2014,11,27,3,Thursday,8930,7672,5242,True
26,2013-11-28,19839,2013,11,28,3,Thursday,8302,6489,5048,True
6,2011-11-24,18427,2011,11,24,3,Thursday,7356,7361,3710,True
37,2014-12-25,20,2014,12,25,3,Thursday,6,13,1,True
27,2013-12-25,20,2013,12,25,2,Wednesday,5,13,2,True
47,2015-12-25,14,2015,12,25,4,Friday,6,4,4,True
17,2012-12-25,11,2012,12,25,1,Tuesday,6,2,3,True

### Merge holiday_sales with calendar to get specific events and event types

Remove month and year from daily_sales, as it is causing issues witht the calendar merge

In [25]:
daily_sales_adjusted = daily_sales.drop('year', 1)

In [26]:
daily_sales_adjusted = daily_sales_adjusted.drop('month', 1)

In [27]:
calendar["date"] = calendar["date"].astype("datetime64")

In [28]:
cols = list(daily_sales_adjusted.columns) + ['event_name_1', 'event_name_2', 'event_type_1', 'event_type_2']

In [29]:
daily_sales_merged = pd.merge(daily_sales_adjusted, calendar, left_on="date", right_on="date")[cols]

### The Super Bowl outputs the most sales for general events

In [30]:
daily_sales_merged.groupby("event_name_1")["daily_sales"].sum().sort_values(ascending=False)

event_name_1
SuperBowl              245544
Purim End              215742
LaborDay               210773
PresidentsDay          206678
ValentinesDay          200974
StPatricksDay          200758
Easter                 197588
LentStart              184362
LentWeek2              178482
Eid al-Fitr            176338
ColumbusDay            175824
VeteransDay            175594
Ramadan starts         173898
EidAlAdha              172520
Mother's day           171057
IndependenceDay        168554
NBAFinalsEnd           167821
Pesach End             167251
Chanukah End           167134
MartinLutherKingDay    166893
OrthodoxChristmas      166721
MemorialDay            163498
NBAFinalsStart         159372
OrthodoxEaster         153108
Halloween              150297
Father's day           146248
Cinco De Mayo          131294
NewYear                128842
Thanksgiving           105650
Christmas                  78
Name: daily_sales, dtype: int64

### Religious events are the event type with the most sales

In [31]:
daily_sales_merged.groupby("event_type_1")["daily_sales"].sum().sort_values(ascending=False)

event_type_1
Religious    1755556
National     1502384
Cultural     1198216
Sporting      572737
Name: daily_sales, dtype: int64

### Event_name_2 and event_type_2 have much fewer associated sales

In [32]:
daily_sales_merged.groupby("event_name_2")["daily_sales"].sum().sort_values(ascending=False)

event_name_2
Cinco De Mayo     43203
Father's day      42494
OrthodoxEaster    38934
Easter            24018
Name: daily_sales, dtype: int64

In [33]:
daily_sales_merged.groupby("event_type_2")["daily_sales"].sum().sort_values(ascending=False)

event_type_2
Cultural     109715
Religious     38934
Name: daily_sales, dtype: int64